[
  {
    "name": "Wordle Clone",
    "material_icon": "language",
    "description": ["A simple clone from the popular game \"Wordle\" that I wanted to try recreating.", "Currently it's a simple website using html, css, and javascript"],
    "links": [
      { "link": "https://github.com/LittleTealeaf/wordle", "icon": "code" },
      {
        "link": "https://littletealeaf.github.io/wordle",
        "icon": "language"
      }
    ],
    "image": "wordle.png"
  },
  {
    "name": "p5.js Data Visualization",
    "material_icon": "query_stats",
    "description": [
      "A visualization analyzing data pulled from the 2021 Stack Overflow survey data. This visual work depicts the relationship of languages programmers indicated they currently worked with versus what they wanted to work with.",
      "I used python in a jupyter notebook to compile the data, and imported that into p5.js, where I created this interactive graphic."
    ],
    "links": [
      {
        "link": "https://github.com/LittleTealeaf/GDD-140-Project-6.2",
        "icon": "code"
      },
      {
        "link": "https://littletealeaf.github.io/GDD-140-Project-6.2",
        "icon": "language"
      },
      {
        "link": "https://github.com/LittleTealeaf/GDD-140-Project-6.2/blob/main/python/notebook.ipynb",
        "icon": "article"
      }
    ],
    "image": "GDD-140-Project-6.2-resize.jpg"
  },
  {
    "name": "SER-225 Platform Game",
    "material_icon": "sports_esports",
    "description": [
      "A legacy group project I worked during the Fall 2021 Semester. My group was given a previously constructed game, and instructed to learn it and continue development. I acted as the groups scrum master, managing pull requests into the production branch",
      "I focused most of my efforts on reconstructing various core functionalities that needed to be changed to support our ideas. This included revamping the menu system, level loading system, and more."
    ],
    "links": [
      {
        "link": "https://github.com/LittleTealeaf/SER-225-Team-A2",
        "icon": "code"
      }
    ],
    "image": "SER-225-Project.png"
  },
  {
    "name": "GitHub Chat App",
    "material_icon": "android",
    "description": [
      "A chat app I created during an Android Development course at Quinnipiac University. I worked on this project alone rather than the suggested 3-member group.",
      "I used both Firebase and GitHub's REST API to create a chat app that allows users to sign in using their GitHub account, and chat in chat rooms created for each repository they own or contribute to."
    ],
    "links": [
      {
        "link": "https://github.com/LittleTealeaf/SER-210-Final",
        "icon": "code"
      }
    ],
    "image": "SER-210-Final.png"
  },
  {
    "name": "Connect-4 Evaluator",
    "material_icon": "grid_4x4",
    "description": [
      "In my intro to data science course, I worked on a project learning the stoastic steepest descent algorithm in the context of a neural network.",
      "Using a dataset of states of Connect-4 and their outcome, I attempted to train a naive neural network to predict the winner of a given board."
    ],
    "links": [
      {
        "link": "https://github.com/LittleTealeaf/DS-210-Final",
        "icon": "code"
      },
      {
        "link": "https://littletealeaf.github.io/DS-210-Final",
        "icon": "language"
      },
      {
        "link": "https://littletealeaf.github.io/DS-210-Final/report.pdf",
        "icon": "article"
      }
    ]
  },
  {
    "name": "JavaMarkdown",
    "description": [
      "One of my more free-time projects. I'm building a simple library that streamlines writing markdown-formatted strings in Java. This makes it simple for developers to use for programs that interact with a markdown-supporting"
    ],
    "links": [
      {
        "icon": "code",
        "link": "https://github.com/LittleTealeaf/JavaMarkdown"
      }
    ],
    "material_icon": "coffee"
  },
  {
    "name": "littletealeaf.github.io",
    "material_icon": "language",
    "description": [
      "The website you are literally looking at. Go you! After previous iterations of this website were made using Next.js, I decided to go back to the good old HTML/CSS/JS stack and really learn how to work them!"
    ],
    "links": [
      { "link": "https://github.com/LittleTealeaf/littletealeaf.github.io", "icon": "code" },
      {
        "link": "#home",
        "icon": "language"
      }
    ]
  }
]
